# 3. метод move(a, b),
# где а = [x, y] - текущие координаты, b = [x, y] - новые координаты.
# Метод должен проверить новые координаты, если там пусто, то переписать обьект фигуры из старых координат в новые,
# в старые координаты занести '0', записать новые координаты в объект фигуры.
#
#
# Если в новых координатах есть объект,
# то проверить его цвет и переписать в соответствующий список сбитых фигур в экземпяре Board,
# после перенести объект из текущих координат в новые по первому алгоритму. Корректность хода проверять не надо,
# это будет делать метод legal_moves самой фигуры. Дополнительная проверка для пешки (если fig_type пустой),
# если self.first_move = True, то походить и изменить на False


class move(self):
    def move (self, a, b):
        if




